import analyzer as an
import numpy as np
import matplotlib.pyplot as plt

# Генерируем массив временных меток от 0 до 1 секунды.
# Всего создается 44100 точек, что соответствует частоте дискретизации 44.1 кГц.
# Параметр False указывает не включать конечную точку (1.0)
t = np.linspace(0, 1, 44100, False)

# Математический синтез сложного двухчастотного сигнала:
# Компонент 1: чистая синусоида частотой 8000 Гц (8 кГц)
# Компонент 2: чистая синусоида частотой 15000 Гц (15 кГц)
sig = np.sin(2 * np.pi * 8000 * t) + np.sin(2 * np.pi * 15000 * t)

# Создаем графическое окно, разделенное на два отдельных графика (поднабора осей) по вертикали.
# Параметр sharex=True связывает масштабирование оси времени X для обоих графиков.
fig, (ax1, ax2) = plt.subplots(2, 1, sharex=True)

# Отрисовка исходного сигнала
ax1.plot(t, sig)
ax1.set_title('8 kHz and 15 kHz sinusoids')  # Заголовок
# Масштабируем оси: смотрим на крошечный начальный участок времени от 0 до 0.001 секунды (1 миллисекунда),
# чтобы можно было отчетливо рассмотреть форму волны. Ось Y ограничена амплитудой от -2 до 2.
ax1.axis([0, 1e-3, -2, 2])

# Фильтрация сигнала
# Пропускаем наш синтезированный сигнал через полосовой фильтр Баттерворта из модуля analyzer.
# Задаем полосу пропускания от 20 до 10 000 Гц.
filtered = an.filter_bandpass(sig, f_low=20, f_high=10000, sample_rate=44100)

# Отрисовка отфильтрованного сигнала
ax2.plot(t, filtered)
ax2.set_title('After [20, 10000] Hz bandpass filter')
ax2.axis([0, 1e-3, -2, 2])
ax2.set_xlabel('Time (seconds)')
plt.tight_layout()
plt.show()
